[
  {
    "listingId": "102748296",
    "shareUrl": "https://dorisgee.com/mylistings.html/listing.r2922793-6036-brantford-avenue-burnaby-v5e-2r7.102748296",
    "listingDetails": "Status: Active MLS® Num: R2922793 Bedrooms: 8 Bathrooms: 9 Floor Area: 4,417 sq. ft.410 m2",
    "price": "$3,399,900",
    "address": "6036 BRANTFORD Avenue Burnaby V5E 2R7 Upper Deer Lake",
    "detailedInfo": "Upper Deer Lake. BRAND NEW, Custom Built over 4400 sq ft of Quality, Luxury. Grand Entrance 20'3 Ceiling in Foyer. Open Living/Dining/ Family/Kitchen (plus large Wok kitchen). Bedroom on MAIN w/ full ensuite plus walk in closet, 4 bedroom up stairs all with ensuites. High End Stainless Steel appliances,. Legal 1 Bedroom Suite in basement with potential for 2 more suites. Media Room. H/W Radiant Heat. Air Conditioning. 602 sq ft Garage with rough-in bathroom plus 2 Car open parking. Walking Distance with trail down Brantford to Deer Lake Park. Minutes to Metrotown Shopping, Crystal Mall, Rec Centre on Kensington overpass including Burnaby Hockey Winter Club. K-7 Ecole Brantford Elementary, Burnaby Central Secondary. 1 Bus to SFUniversity. Easy access to Highways. 2-5-10 Year Warranty. General Info: Property Type: Residential Detached Dwelling Type: House/Single Family Home Style: 2 Storey w/Bsmt. Year built: 2024 (Age: 0) Total area: 4,417 sq. ft.410.35 m2 Total Floor Area: 4,417 sq. ft.410.35 m2 Price Per SqFt: $769.73 Total unfinished area: 0 sq. ft.0 m2 Main Floor Area: 1,639 sq. ft.152.27 m2 Floor Area Above Main: 1,139 sq. ft.105.82 m2 Floor Area Above Main 2: 0 sq. ft.0 m2 Floor Area Below Main: 0 sq. ft.0 m2 Basement Area: 1,639 sq. ft.152.27 m2 No. Floor Levels: 3.0 Bedrooms: 8 (Above Grd: 5) Bathrooms: 9.0 (Full:8/Half:1) Kitchens: 3 Rooms: 25 Taxes: $9,694.92 / 2024 Lot Area: 7,241 sq. ft.672.71 m2 Lot Frontage: 52'15.85 m Lot Depth: 139 Rear Yard Exposure: East Outdoor Area: Balcony(s), Patio(s) Water Supply: City/Municipal Plan: NWP70864 Additional Info: Heating: Hot Water, Natural Gas, Radiant Construction: Frame - Wood Foundation: Concrete Perimeter Basement: Fully Finished Roof: Asphalt Floor Finish: Hardwood, Tile Fireplaces: 2 Fireplace Details: Electric Parking: Garage; Double Parking Total/Covered: 4 / 2 Parking Access: Lane, Rear Exterior Finish: Stucco Title to Land: Freehold NonStrata Suite: Legal Suite Room Information: Floor Type Size Other Main Living Room 14'11\"4.55 m × 14'5\"4.39 m - Main Dining Room 14'5\"4.39 m × 9'4\"2.84 m - Main Kitchen 22'9\"6.93 m × 15'6\"4.72 m - Main Wok Kitchen 12'9\"3.89 m × 8'9\"2.67 m - Main Family Room 15'6\"4.72 m × 15'2\"4.62 m - Main Bedroom 16'4\"4.98 m × 11'2\"3.40 m - Main Walk-In Closet 4'11\"1.50 m × 4'1.22 m - Main Foyer 12'5\"3.78 m × 7'7\"2.31 m - Above Primary Bedroom 17'9\"5.41 m × 13'5\"4.09 m - Above Walk-In Closet 7'2.13 m × 5'10\"1.78 m - Above Bedroom 11'10\"3.61 m × 10'9\"3.28 m - Above Bedroom 12'9\"3.89 m × 10'11\"3.33 m - Above Walk-In Closet 5'1.52 m × 3'11\"1.19 m - Above Bedroom 16'7\"5.05 m × 11'3\"3.43 m - Above Walk-In Closet 5'5\"1.65 m × 5'1.52 m - Above Laundry 7'4\"2.24 m × 6'2\"1.88 m - Bsmt Media Room 20'5\"6.22 m × 13'8\"4.17 m - Bsmt Bedroom 15'9\"4.80 m × 11'6\"3.51 m - Bsmt Living Room 19'5.79 m × 12'7\"3.84 m - Bsmt Bedroom 10'10\"3.30 m × 9'6\"2.90 m - Bsmt Laundry 3'.91 m × 2'.61 m - Bsmt Living Room 15'9\"4.80 m × 11'10\"3.61 m - Bsmt Kitchen 8'3\"2.51 m × 6'3\"1.91 m - Bsmt Bedroom 12'1\"3.68 m × 10'1\"3.07 m - Bsmt Laundry 3'2\".97 m × 3'2\".97 m - Bathrooms: Floor Ensuite Pieces Other Main No 2 Main Yes 3 Above Yes 4 Above Yes 4 Above Yes 3 Above Yes 3 Bsmt No 3 Bsmt No 4 Bsmt No 4 Features Included: Air Conditioning, Clothes Washer/Dryer/Fridge/Stove/Dishwasher, Drapes/Window Coverings, Garage Door Opener, Oven - Built In, Range Top, Security System, Smoke Alarm Site Influences: Central Location, Recreation Nearby, Shopping Nearby Amenities: None View: MOUNTAIN VIEWS Legal Description: LOT 2, PLAN NWP70864, DISTRICT LOT 92, GROUP 1, NEW WESTMINSTER LAND DISTRICT Other Details: Property Disclosure: No Fixtures Leased: No Fixtures Removed: No Services Connected: Electricity, Natural Gas, Sanitary Sewer, Storm Sewer Listing Info: Original Price: $3,399,900"
  },
  {
    "listingId": "102157843",
    "shareUrl": "https://dorisgee.com/mylistings.html/listing.r2901601-6691-waltham-avenue-burnaby-v5h-3v6.102157843",
    "listingDetails": "Status: Active MLS® Num: R2901601 Bedrooms: 7 Bathrooms: 9 Floor Area: 4,479 sq. ft.416 m2",
    "price": "$3,388,000",
    "address": "6691 WALTHAM Avenue Burnaby V5H 3V6 Upper Deer Lake",
    "detailedInfo": "Upper Deer Lake luxury home offers unparalleled quality across 3 levels and 4,479 square feet. A spacious gourmet kitchen, ideal for chefs and cooking enthusiasts, huge wok kitchen. The home features stunning engineered hardwood floors, with a main floor bedroom and 3 additional bedrooms upstairs. A legal 2-bedroom suite and separate 1-bedroom nanny's quarter with a private entrance provide flexible living options. Enjoy entertainment in the media room, while the home stays comfortable with hot water radiant heat, air conditioning, HRV system, security features including 4 cameras and automation. Attached garage, open parking, automatic security gate, and bonus solar panels help save on electricity costs. For remote work, a separate detached 404 sq ft office space with 2 pc bath for privacy. General Info: Property Type: Residential Detached Dwelling Type: House/Single Family Home Style: 2 Storey w/Bsmt. Year built: 2024 (Age: 0) Total area: 4,479 sq. ft.416.11 m2 Total Floor Area: 4,479 sq. ft.416.11 m2 Price Per SqFt: $756.42 Total unfinished area: 0 sq. ft.0 m2 Main Floor Area: 1,679 sq. ft.155.98 m2 Floor Area Above Main: 1,106 sq. ft.102.75 m2 Floor Area Above Main 2: 0 sq. ft.0 m2 Floor Area Detached 2nd Residence: 404 sq. ft.37.53 m2 Floor Area Below Main: 0 sq. ft.0 m2 Basement Area: 1,694 sq. ft.157.38 m2 No. Floor Levels: 3.0 Bedrooms: 7 (Above Grd: 4) Bathrooms: 9.0 (Full:6/Half:3) Kitchens: 3 Rooms: 27 Taxes: $0 / 2024 Lot Area: 6,570 sq. ft.610.37 m2 Lot Frontage: 50'15.24 m Lot Depth: 131.3 Outdoor Area: Balcny(s) Patio(s) Dck(s) Water Supply: City/Municipal Plan: NWP84203 Additional Info: Heating: Hot Water, Natural Gas, Radiant Construction: Frame - Wood Foundation: Concrete Perimeter Basement: Fully Finished, Separate Entry Full Height: 8'0 Roof: Asphalt Floor Finish: Hardwood, Laminate, Tile Fireplaces: 2 Fireplace Details: Gas - Natural Parking: Garage; Double, Open Parking Total/Covered: 4 / 2 Parking Access: Front Exterior Finish: Stone, Stucco, Wood Title to Land: Freehold NonStrata Suite: Licensed Suite Room Information: Floor Type Size Other Main Living Room 14'2\"4.32 m × 11'5\"3.48 m - Main Dining Room 18'5\"5.61 m × 14'3\"4.34 m - Main Kitchen 14'8\"4.47 m × 13'3.96 m - Main Wok Kitchen 14'8\"4.47 m × 7'1\"2.16 m - Main Eating Area 0'.00 m × 0'.00 m - Main Family Room 18'5\"5.61 m × 14'8\"4.47 m - Main Bedroom 10'3.05 m × 9'2.74 m - Main Mud Room 8'2\"2.49 m × 6'11\"2.11 m - Main Foyer 12'3\"3.73 m × 7'1\"2.16 m - Above Primary Bedroom 14'4.27 m × 12'11\"3.94 m - Above Walk-In Closet 7'6\"2.29 m × 5'10\"1.78 m - Above Bedroom 13'9\"4.19 m × 11'3.35 m - Above Walk-In Closet 5'1.52 m × 4'11\"1.50 m - Above Bedroom 11'2\"3.40 m × 11'1\"3.38 m - Above Laundry 9'6\"2.90 m × 7'11\"2.41 m - Bsmt Media Room 17'6\"5.33 m × 13'6\"4.11 m - Bsmt Utility 7'11\"2.41 m × 4'1.22 m - Bsmt Storage 8'4\"2.54 m × 3'7\"1.09 m - Bsmt Recreation Room 17'10\"5.44 m × 12'8\"3.86 m - Bsmt Bedroom 13'11\"4.24 m × 9'10\"3.00 m - Bsmt Walk-In Closet 4'11\"1.50 m × 4'8\"1.42 m - Bsmt Living Room 14'1\"4.29 m × 10'6\"3.20 m - Bsmt Kitchen 11'3\"3.43 m × 5'3\"1.60 m - Bsmt Bedroom 9'1\"2.77 m × 8'2\"2.49 m - Bsmt Bedroom 11'6\"3.51 m × 8'11\"2.72 m - Bsmt Laundry 3'.91 m × 2'.61 m - Main Office 17'5.18 m × 15'5\"4.70 m - Bathrooms: Floor Ensuite Pieces Other Main No 2 Main Yes 3 Above Yes 5 Above Yes 3 Above Yes 4 Bsmt No 2 Bsmt No 3 Bsmt No 4 Main No 2 Features Included: Air Conditioning, Clothes Washer/Dryer/Fridge/Stove/Dishwasher, Drapes/Window Coverings, Heat Recov. Vent., Security System, Smoke Alarm Site Influences: Central Location, Recreation Nearby, Shopping Nearby Amenities: None Legal Description: LOT 2, PLAN NWP84203, DISTRICT LOT 93, GROUP 1, NEW WESTMINSTER LAND DISTRICT Other Details: Dist to Public Trans: CLOSE Dist to School Bus: CLOSE Property Disclosure: No Fixtures Leased: No Fixtures Removed: No Services Connected: Electricity, Natural Gas Listing Info: Original Price: $3,388,000"
  },
  {
    "listingId": "102991935",
    "shareUrl": "https://dorisgee.com/mylistings.html/listing.r2931184-5634-marine-drive-burnaby-v5j-3g8.102991935",
    "listingDetails": "Status: Active MLS® Num: R2931184 Bedrooms: 6 Bathrooms: 6 Floor Area: 4,560 sq. ft.424 m2",
    "price": "$3,298,000",
    "address": "5634 MARINE Drive Burnaby V5J 3G8 Big Bend",
    "detailedInfo": "Attention Investors! PRIME South Burnaby Investment Opportunity! This expansive 17,160 sq ft lot (143 x 120) offers incredible potential, including future subdivision possibilities. The property features a spacious home with 6 separate suites, providing an excellent opportunity for income generation or accommodating extended family with privacy and independence. Highlights include Hot water heating for efficient comfort. Ample open parking for tenants or large families. Convenient location, just minutes from Byrne Creek, Market Crossing Shopping, and the Fraser River, perfect for nature lovers and pet owners. Close to Riverway Golf Course and accessible public bus transit. Zoned within the catchment area for Glenwood Elementary (K-7) and Burnaby South Secondary. Only a 10-minute drive to Metrotown and Crystal Mall, with easy access to Vancouver and YVR. This property is an ideal investment or a dream home for families looking to capitalize on its size and potential. Don’t miss out on this rare opportunity General Info: Property Type: Residential Detached Dwelling Type: House/Single Family Home Style: 3 Storey w/Bsmt. Year built: 999 (Age: 1,025) Total area: 4,560 sq. ft.423.64 m2 Total Floor Area: 4,560 sq. ft.423.64 m2 Price Per SqFt: $723.25 Total unfinished area: 473 sq. ft.43.94 m2 Main Floor Area: 1,431 sq. ft.132.94 m2 Floor Area Above Main: 1,236 sq. ft.114.83 m2 Floor Area Above Main 2: 0 sq. ft.0 m2 Floor Area Below Main: 1,420 sq. ft.131.92 m2 Basement Area: 0 sq. ft.0 m2 No. Floor Levels: 4.0 Bedrooms: 6 (Above Grd: 6) Bathrooms: 6.0 (Full:6/Half:0) Kitchens: 6 Rooms: 29 Taxes: $10,560.34 / 2024 Lot Area: 17,160.02 sq. ft.1,594.22 m2 Lot Frontage: 143'43.586 m Lot Depth: 120 Rear Yard Exposure: South Outdoor Area: None Water Supply: City/Municipal Plan: NWP450 Additional Info: Heating: Electric, Hot Water, Natural Gas Construction: Frame - Wood Foundation: Concrete Perimeter Basement: Crawl, Partly Finished, Separate Entry Full Height: 6'9 Roof: Asphalt Floor Finish: Mixed Fireplaces: 0 Fireplace Details: Wood Parking: Open, RV Parking Avail. Parking Total/Covered: 6 / 0 Parking Access: Front Exterior Finish: Wood Title to Land: Freehold NonStrata Suite: Licensed Suite Room Information: Floor Type Size Other Main Living Room 19'2\"5.84 m × 11'1\"3.38 m - Main Kitchen 12'1\"3.68 m × 7'7\"2.31 m - Main Bedroom 12'3.66 m × 9'4\"2.84 m - Main Storage 5'3\"1.60 m × 5'1.52 m - Main Living Room 18'4\"5.59 m × 14'8\"4.47 m - Main Kitchen 11'1\"3.38 m × 7'11\"2.41 m - Main Bedroom 12'3.66 m × 9'3\"2.82 m - Main Laundry 3'5\"1.04 m × 2'10\".86 m - Main Foyer 11'6\"3.51 m × 8'2\"2.49 m - Above Living Room 15'6\"4.72 m × 8'2\"2.49 m - Above Kitchen 13'8\"4.17 m × 7'9\"2.36 m - Above Bedroom 13'3\"4.04 m × 10'3\"3.12 m - Above Living Room 13'2\"4.01 m × 12'3\"3.73 m - Above Kitchen 11'9\"3.58 m × 7'10\"2.39 m - Above Bedroom 13'10\"4.22 m × 9'1\"2.77 m - Above Storage 9'3\"2.82 m × 5'2\"1.57 m - Below Living Room 14'1\"4.29 m × 13'3\"4.04 m - Below Kitchen 12'11\"3.94 m × 9'9\"2.97 m - Below Bedroom 11'3\"3.43 m × 8'4\"2.54 m - Below Living Room 14'2\"4.32 m × 10'1\"3.07 m - Below Dining Room 14'2\"4.32 m × 7'11\"2.41 m - Below Kitchen 9'5\"2.87 m × 7'10\"2.39 m - Below Bedroom 16'5\"5.00 m × 13'4\"4.06 m - Bsmt Laundry 14'2\"4.32 m × 11'2\"3.40 m - Bsmt Workshop 7'4\"2.24 m × 6'2\"1.88 m - Bsmt Utility 6'2\"1.88 m × 4'11\"1.50 m - Bsmt Utility 13'4\"4.06 m × 6'8\"2.03 m - Bsmt Storage 11'5\"3.48 m × 6'9\"2.06 m - Bsmt Storage 18'10\"5.74 m × 5'9\"1.75 m - Bathrooms: Floor Ensuite Pieces Other Main No 4 Main No 4 Above No 4 Above No 4 Below No 4 Below No 4 Features Included: Clothes Washer/Dryer/Fridge/Stove/Dishwasher Site Influences: Central Location, Recreation Nearby, Shopping Nearby Amenities: None View: LUSH LANSCAPES Legal Description: PARCEL A(RP13585), LOT 5, PLAN NWP450, DISTRICT LOT 162, GROUP 1, NEW WESTMINSTER LAND DISTRICT Other Details: Property Disclosure: Yes Fixtures Leased: No Fixtures Removed: No Services Connected: Electricity, Natural Gas, Septic Listing Info: Original Price: $3,298,000"
  },
  {
    "listingId": "101610638",
    "shareUrl": "https://dorisgee.com/mylistings.html/listing.r2877199-726-edgar-avenue-coquitlam-v3k-2j5.101610638",
    "listingDetails": "Status: Active MLS® Num: R2877199 Bedrooms: 3 Bathrooms: 1 Floor Area: 1,312 sq. ft.122 m2",
    "price": "$3,100,000",
    "address": "726 EDGAR Avenue Coquitlam V3K 2J5 Coquitlam West",
    "detailedInfo": "**Development Opportunity: 726 Edgar Ave, Coquitlam**—Positioned within the Maillardville neighbourhood plan, this site, zoned for medium density apartment residential, is part of a land assembly of 6 potential lots for multi-family development. Surrounded by four-story apartment buildings and offering back lane access, it's strategically located near amenities and transport, making it a prime investment for developers aiming to capitalize on Coquitlam’s growth. General Info: Property Type: Residential Detached Dwelling Type: House/Single Family Home Style: 2 Storey Year built: 1955 (Age: 69) Total area: 1,312 sq. ft.121.89 m2 Total Floor Area: 1,312 sq. ft.121.89 m2 Price Per SqFt: $2,362.8 Total unfinished area: 0 sq. ft.0 m2 Main Floor Area: 960 sq. ft.89.19 m2 Floor Area Above Main: 0 sq. ft.0 m2 Floor Area Above Main 2: 0 sq. ft.0 m2 Floor Area Below Main: 352 sq. ft.32.7 m2 Basement Area: 0 sq. ft.0 m2 No. Floor Levels: 2.0 Bedrooms: 3 (Above Grd: 3) Bathrooms: 1.0 (Full:1/Half:0) Kitchens: 1 Rooms: 7 Taxes: $5,096.62 / 2024 Lot Area: 7,245 sq. ft.673.08 m2 Lot Frontage: 63'2\"19.263 m Lot Depth: 114.9 Outdoor Area: Patio(s) Water Supply: City/Municipal Plan: NWP15059 Additional Info: Heating: Forced Air, Natural Gas Construction: Frame - Wood Foundation: Concrete Perimeter Basement: None Roof: Asphalt Floor Finish: Mixed Fireplaces: 1 Fireplace Details: Wood Parking: Carport; Single Parking Total/Covered: 1 / 1 Parking Access: Front Exterior Finish: Stucco Title to Land: Freehold NonStrata Room Information: Floor Type Size Other Main Living Room 13'3\"4.04 m × 12'3\"3.73 m - Main Kitchen 18'3\"5.56 m × 9'2.74 m - Main Primary Bedroom 12'9\"3.89 m × 9'5\"2.87 m - Main Bedroom 10'3.05 m × 8'2.44 m - Main Bedroom 11'6\"3.51 m × 7'5\"2.26 m - Main Laundry 7'2.13 m × 6'8\"2.03 m - Below Family Room 23'7.01 m × 15'4.57 m - Bathrooms: Floor Ensuite Pieces Other Main No 4 Site Influences: Central Location, Recreation Nearby, Shopping Nearby Legal Description: LOT 35, PLAN NWP15059, DISTRICT LOT 1&3, NEW WESTMINSTER LAND DISTRICT Other Details: Property Disclosure: No Fixtures Leased: No Fixtures Removed: No Services Connected: Electricity, Natural Gas Listing Info: Original Price: $3,100,000"
  },
  {
    "listingId": "101622725",
    "shareUrl": "https://dorisgee.com/mylistings.html/listing.r2877795-726-edgar-avenue-coquitlam-v3k-2j5.101622725",
    "listingDetails": "Status: Active MLS® Num: R2877795",
    "price": "$3,100,000",
    "address": "726 EDGAR Avenue Coquitlam V3K 2J5 Coquitlam West",
    "detailedInfo": "**Development Opportunity: 726 Edgar Ave, Coquitlam**- Positioned within the Maillardville neighbourhood plan, this site, zoned for medium density apartment residential, is part of a land assembly of 6 potential lots for multi-family development. Surrounded by four-story apartment buildings and offering back lane access, it's strategically located near amenities and transport, making it a prime investment for developers aiming to capitalize on Coquitlam's growth. General Info: Property Type: Land Only Taxes: $5,096.62 / 2024 Lot Area: 7,245 sq. ft.673.08 m2 Lot Frontage: 63'2\"19.263 m Lot Depth: 114.9 Water Supply: City/Municipal Additional Info: Title to Land: Freehold NonStrata Legal Description: LOT 35, PLAN NWP15059, DISTRICT LOT 1&3, NEW WESTMINSTER LAND DISTRICT DBL EXP R2877199 Land Info: Access to property: Allowed Access Cable Service: On Property Natural Gas: At Lot Line Electricity: At Lot Line Sanitary Sewer: Available Telephone Service: On Property Trees: No Storm Sewer: Nearby Potential for Rezoning: Yes Sketch Attached: No Restrictions: None Listing Info: Original Price: $3,100,000"
  },
  {
    "listingId": "103050814",
    "shareUrl": "https://dorisgee.com/mylistings.html/listing.r2933212-3621-cambridge-street-vancouver-v5k-1m5.103050814",
    "listingDetails": "Status: Active MLS® Num: R2933212 Bedrooms: 7 Bathrooms: 6 Floor Area: 2,917 sq. ft.271 m2",
    "price": "$2,968,000",
    "address": "3621 CAMBRIDGE Street Vancouver V5K 1M5 Hastings Sunrise",
    "detailedInfo": "Don't miss out on this remarkable opportunity! Discover an exquisite newer home boasting BREATHTAKING VIEWS of the INLET and MOUNTAINS, nestled in the sought-after Sunrise neighborhood. This three-level residence with custom touches throughout is a true gem. Experience the open-concept main level, featuring a radiant south-facing great room with an elegant granite fireplace and a gourmet kitchen equipped with top-notch appliances including a Wolf stove, convection steam oven, and sub-zero fridge. Upstairs, revel in the luxurious primary bedroom alongside two additional bedrooms, with a fourth bedroom featuring an ensuite in the basement. Additionally, seize the chance for a fantastic investment with a 2-bedroom basement suite and a 475 sq ft one-bedroom lane home. Security System. Rough In Vac. HRV. Perfectly situated near New Brighton Park and within the esteemed school catchment of Sir John Franklin Elementary and Templeton Secondary. Embrace this prime location-call today to schedule your exclusive viewing! General Info: Property Type: Residential Detached Dwelling Type: House/Single Family Home Style: 2 Storey w/Bsmt. Year built: 2017 (Age: 7) Total area: 2,917 sq. ft.271 m2 Total Floor Area: 2,917 sq. ft.271 m2 Price Per SqFt: $1,017.48 Total unfinished area: 0 sq. ft.0 m2 Main Floor Area: 964 sq. ft.89.56 m2 Floor Area Above Main: 912 sq. ft.84.73 m2 Floor Area Above Main 2: 0 sq. ft.0 m2 Floor Area Detached 2nd Residence: 475 sq. ft.44.13 m2 Floor Area Below Main: 1,041 sq. ft.96.71 m2 Basement Area: 0 sq. ft.0 m2 No. Floor Levels: 3.0 Bedrooms: 7 (Above Grd: 4) Bathrooms: 6.0 (Full:5/Half:1) Kitchens: 3 Rooms: 21 Taxes: $7,889.36 / 2024 Lot Area: 4,024 sq. ft.373.84 m2 Lot Frontage: 33'10.058 m Lot Depth: 121.96 Rear Yard Exposure: North Outdoor Area: Balcony(s), Patio(s) Water Supply: City/Municipal Plan: VAP100, 5157 Additional Info: Heating: Hot Water, Natural Gas, Radiant Construction: Frame - Wood Foundation: Concrete Perimeter Basement: Full, Fully Finished, Separate Entry Full Height: 8'0 Roof: Torch-On Floor Finish: Hardwood, Mixed, Tile Fireplaces: 1 Fireplace Details: Gas - Natural Parking: Garage; Single Parking Total/Covered: 2 / 1 Parking Access: Lane Driveway: Asphalt Exterior Finish: Stone, Stucco, Wood Title to Land: Freehold NonStrata Suite: Legal Suite Room Information: Floor Type Size Other Main Living Room 19'8\"5.99 m × 14'4.27 m - Main Dining Room 17'10\"5.44 m × 14'1\"4.29 m - Main Kitchen 13'11\"4.24 m × 10'11\"3.33 m - Main Laundry 5'2\"1.57 m × 2'10\".86 m - Main Foyer 8'3\"2.51 m × 7'8\"2.34 m - Above Primary Bedroom 13'10\"4.22 m × 13'3\"4.04 m - Above Walk-In Closet 9'6\"2.90 m × 7'1\"2.16 m - Above Bedroom 13'10\"4.22 m × 9'8\"2.95 m - Above Bedroom 12'1\"3.68 m × 9'9\"2.97 m - Bsmt Bedroom 12'6\"3.81 m × 11'1\"3.38 m - Bsmt Utility 6'4\"1.93 m × 3'9\"1.14 m - Bsmt Storage 7'2.13 m × 3'.91 m - Bsmt Living Room 10'11\"3.33 m × 8'8\"2.64 m - Bsmt Kitchen 7'9\"2.36 m × 6'6\"1.98 m - Bsmt Bedroom 11'2\"3.40 m × 10'3\"3.12 m - Bsmt Bedroom 11'2\"3.40 m × 9'10\"3.00 m - Bsmt Laundry 3'2\".97 m × 2'11\".89 m - Main Living Room 10'8\"3.25 m × 9'1\"2.77 m - Main Kitchen 9'1\"2.77 m × 7'2\"2.18 m - Above Bedroom 12'8\"3.86 m × 7'7\"2.31 m - Above Laundry 0'.00 m × 0'.00 m - Bathrooms: Floor Ensuite Pieces Other Main No 2 Above Yes 4 Above No 3 Bsmt No 3 Bsmt No 4 Main No 3 Features Included: Clothes Washer/Dryer, Dishwasher, Drapes/Window Coverings, Heat Recov. Vent., Microwave, Oven - Built In, Refrigerator, Security System, Sprinkler - Fire, Stove Site Influences: Central Location, Recreation Nearby, Shopping Nearby View: CITY & MOUNTAIN VIEW Legal Description: LOT 787A, PLAN VAP100, PART E1/2, DISTRICT LOT HT, NEW WESTMINSTER LAND DISTRICT, EXC PT IN REF PL 5157 Other Details: Property Disclosure: Yes Fixtures Leased: No Fixtures Removed: No Services Connected: Electricity, Natural Gas Listing Info: Original Price: $2,968,000"
  },
  {
    "listingId": "102398394",
    "shareUrl": "https://dorisgee.com/mylistings.html/listing.r2911245-5225-woodsworth-street-burnaby-v5g-1s5.102398394",
    "listingDetails": "Status: Active MLS® Num: R2911245 Bedrooms: 6 Bathrooms: 7 Floor Area: 3,907 sq. ft.363 m2",
    "price": "$2,699,000",
    "address": "5225 WOODSWORTH Street Burnaby V5G 1S5 Central BN",
    "detailedInfo": "Open House Saturday, September 21, 2:00-4:00PM Experience Luxury in this brand new 3-Level Home. All the Modern Features offered today. Hot Water Radiant Heat on the main and upper floor, hot water baseboard heating for the basement. R/I Air Condition. Auxiliary Studio with 2 piece bath, electric baseboard heating, perfect for a home studio. Engineered Wood Floors on Main and Upper Hallway. Upper Bedrooms are laminated. Basement with Vinyl plank. 539 Sq ft Legal Suite plus a Separate Suite for a Nanny's quarter or extended family. Fenced Back Yard. Exterior Hardie Board, Stone, Luxe Board. Attached Garage with hot water baseboard heat, 3 Open Parking spaces and room for a Motorhome. Central Location to Rec Centres, Scotia Barn, Burnaby Hockey Winter Club, Christine Sinclair Centre, Shadbolt Centre for the Arts, Deer Lake Park and Burnaby Lake, Metrotown and Amazing Brentwood Shopping. Close to Burnaby Central Secondary and BCIT and Simon Fraser University. 2-5-10 Year Home Warranty. General Info: Property Type: Residential Detached Dwelling Type: House/Single Family Home Style: 2 Storey w/Bsmt. Year built: 2024 (Age: 0) Total area: 3,907 sq. ft.362.97 m2 Total Floor Area: 3,907 sq. ft.362.97 m2 Price Per SqFt: $690.81 Total unfinished area: 0 sq. ft.0 m2 Main Floor Area: 1,187 sq. ft.110.28 m2 Floor Area Above Main: 1,533 sq. ft.142.42 m2 Floor Area Above Main 2: 0 sq. ft.0 m2 Floor Area Detached 2nd Residence: 383 sq. ft.35.58 m2 Floor Area Below Main: 0 sq. ft.0 m2 Basement Area: 1,187 sq. ft.110.28 m2 No. Floor Levels: 3.0 Bedrooms: 6 (Above Grd: 4) Bathrooms: 7.0 (Full:5/Half:2) Kitchens: 2 Rooms: 26 Taxes: $7,189.16 / 2024 Lot Area: 6,537.14 sq. ft.607.32 m2 Lot Frontage: 47'6¼\"14.484 m Lot Depth: 0 Outdoor Area: Fenced Yard Water Supply: City/Municipal Plan: EPP82985 Additional Info: Heating: Baseboard, Hot Water, Radiant Construction: Frame - Wood Foundation: Concrete Perimeter Basement: Fully Finished, Separate Entry Full Height: 8'0 Roof: Asphalt Floor Finish: Hardwood, Laminate, Mixed, Vinyl/Linoleum Fireplaces: 1 Fireplace Details: Gas - Natural Parking: Garage; Double Parking Total/Covered: 5 / 2 Parking Access: Front Driveway: Paving Stone Exterior Finish: Aluminum, Fibre Cement Board, Stone Title to Land: Freehold NonStrata Suite: Legal Suite Room Information: Floor Type Size Other Main Living Room 15'11\"4.85 m × 15'4\"4.67 m - Main Dining Room 15'11\"4.85 m × 7'2.13 m - Main Kitchen 15'11\"4.85 m × 9'2\"2.79 m - Main Pantry 8'11\"2.72 m × 6'2\"1.88 m - Main Den 14'9\"4.50 m × 10'5\"3.18 m - Main Laundry 10'3.05 m × 8'5\"2.57 m - Main Foyer 12'2\"3.71 m × 7'8\"2.34 m - Above Primary Bedroom 19'4\"5.89 m × 15'6\"4.72 m - Above Walk-In Closet 11'11\"3.63 m × 7'5\"2.26 m - Above Bedroom 13'1\"3.99 m × 10'3\"3.12 m - Above Bedroom 12'1\"3.68 m × 11'7\"3.53 m - Above Walk-In Closet 4'4\"1.32 m × 3'11\"1.19 m - Above Bedroom 14'2\"4.32 m × 11'8\"3.56 m - Above Walk-In Closet 4'4\"1.32 m × 3'6\"1.07 m - Bsmt Recreation Room 20'1\"6.12 m × 9'10\"3.00 m - Bsmt Bar Room 10'3\"3.12 m × 7'11\"2.41 m - Bsmt Bedroom 9'11\"3.02 m × 8'11\"2.72 m - Bsmt Laundry 3'2\".97 m × 3'.91 m - Bsmt Storage 8'7\"2.62 m × 3'2\".97 m - Bsmt Living Room 11'4\"3.45 m × 10'5\"3.18 m - Bsmt Dining Room 10'5\"3.18 m × 7'2.13 m - Bsmt Kitchen 13'4\"4.06 m × 4'11\"1.50 m - Bsmt Bedroom 11'8\"3.56 m × 10'3.05 m - Bsmt Laundry 4'11\"1.50 m × 2'4\".71 m - Bsmt Foyer 5'6\"1.68 m × 4'11\"1.50 m - Main Other 20'4\"6.20 m × 16'5\"5.00 m - Bathrooms: Floor Ensuite Pieces Other Main No 2 Above Yes 5 Above Yes 4 Above Yes 5 Bsmt No 4 Bsmt No 4 Main No 2 Features Included: Clothes Washer/Dryer, Dishwasher, Drapes/Window Coverings, Heat Recov. Vent., Microwave, Oven - Built In, Pantry, Range Top, Refrigerator, Smoke Alarm Site Influences: Central Location, Recreation Nearby, Shopping Nearby Amenities: None Legal Description: LOT 1, PLAN EPP82985, DISTRICT LOT 74, GROUP 1, NEW WESTMINSTER LAND DISTRICT Other Details: Property Disclosure: Yes Fixtures Leased: No Fixtures Removed: No Services Connected: Electricity, Natural Gas Listing Info: Original Price: $2,699,000"
  },
  {
    "listingId": "101986235",
    "shareUrl": "https://dorisgee.com/mylistings.html/listing.r2894070-7386-humphries-avenue-burnaby-v3n-3e5.101986235",
    "listingDetails": "Status: Active MLS® Num: R2894070 Bedrooms: 3 Bathrooms: 1 Floor Area: 2,383 sq. ft.221 m2",
    "price": "$2,650,000",
    "address": "7386 HUMPHRIES Avenue Burnaby V3N 3E5 Edmonds BE",
    "detailedInfo": "Call Your Developers Today! The City of Burnaby has given tentative approval to subdivide this property, located at the corner of Humphries and 18th Ave, into two legal lots. As of July 1, 2024, new zoning regulations in British Columbia will support small-scale, multi-unit housing. This prime property is within two blocks of the Edmonds bus stops, potentially qualifying for increased density under the new transit-oriented development guidelines, allowing up to six units per lot. This strategic location offers convenient access to public transit, making it an excellent opportunity for higher-density residential development. Don’t miss out on this unique opportunity to capitalize on the upcoming zoning changes and maximize the potential of this valuable corner lot! General Info: Property Type: Residential Detached Dwelling Type: House/Single Family Home Style: 2 Storey w/Bsmt. Year built: 1918 (Age: 106) Total area: 2,383 sq. ft.221.39 m2 Total Floor Area: 2,383 sq. ft.221.39 m2 Price Per SqFt: $1,112.04 Total unfinished area: 951 sq. ft.88.35 m2 Main Floor Area: 1,046 sq. ft.97.18 m2 Floor Area Above Main: 386 sq. ft.35.86 m2 Floor Area Above Main 2: 0 sq. ft.0 m2 Floor Area Below Main: 0 sq. ft.0 m2 Basement Area: 0 sq. ft.0 m2 No. Floor Levels: 3.0 Bedrooms: 3 (Above Grd: 3) Bathrooms: 1.0 (Full:1/Half:0) Kitchens: 1 Rooms: 11 Taxes: $7,209.02 / 2024 Lot Area: 7,458 sq. ft.692.87 m2 Lot Frontage: 66'20.117 m Lot Depth: 113 Rear Yard Exposure: East Outdoor Area: Balcony(s) Water Supply: City/Municipal Plan: NWP3036 Additional Info: Heating: Forced Air Construction: Frame - Wood Foundation: Concrete Perimeter Basement: None Roof: Asphalt Parking: Garage; Single Parking Total/Covered: 6 / 1 Parking Access: Front Exterior Finish: Wood Title to Land: Freehold NonStrata Room Information: Floor Type Size Other Main Living Room 19'6\"5.94 m × 11'7\"3.53 m - Main Dining Room 11'7\"3.53 m × 11'6\"3.51 m - Main Kitchen 13'9\"4.19 m × 10'8\"3.25 m - Main Eating Area 8'9\"2.67 m × 8'6\"2.59 m - Main Primary Bedroom 13'9\"4.19 m × 11'8\"3.56 m - Main Walk-In Closet 4'11\"1.50 m × 3'5\"1.04 m - Main Foyer 7'2.13 m × 6'6\"1.98 m - Above Bedroom 16'1\"4.90 m × 14'1\"4.29 m - Above Bedroom 13'7\"4.14 m × 10'3\"3.12 m - Above Walk-In Closet 7'5\"2.26 m × 6'1.83 m - Bsmt Wine Room 8'5\"2.57 m × 5'10\"1.78 m - Bathrooms: Floor Ensuite Pieces Other Main No 4 Features Included: Clothes Washer/Dryer/Fridge/Stove/Dishwasher, Drapes/Window Coverings Site Influences: Central Location, Recreation Nearby, Shopping Nearby Amenities: None Legal Description: LOT 16, BLOCK 36, PLAN NWP3036, DISTRICT LOT 30, GROUP 1, NEW WESTMINSTER LAND DISTRICT, 4350-7435 Other Details: Dist to Public Trans: 1 BLK Dist to School Bus: 1 BLK Property Disclosure: No Fixtures Leased: No Fixtures Removed: No Services Connected: Electricity, Natural Gas Listing Info: Original Price: $2,650,000"
  },
  {
    "listingId": "101986503",
    "shareUrl": "https://dorisgee.com/mylistings.html/listing.r2894112-7386-humphries-avenue-burnaby-v3n-3e5.101986503",
    "listingDetails": "Status: Active MLS® Num: R2894112",
    "price": "$2,650,000",
    "address": "7386 HUMPHRIES Avenue Burnaby V3N 3E5 Edmonds BE",
    "detailedInfo": "Call Your Developers Today! The City of Burnaby has given tentative approval to subdivide this property, located at the corner of Humphries and 18th Ave, into two legal lots. As of July 1, 2024, new zoning regulations in British Columbia will support small-scale, multi-unit housing. This prime property is within two blocks of the Edmonds bus stops, potentially qualifying for increased density under the new transit-oriented development guidelines, allowing up to six units per lot. This strategic location offers convenient access to public transit, making it an excellent opportunity for higher-density residential development. Don’t miss out on this unique opportunity to capitalize on the upcoming zoning changes and maximize the potential of this valuable corner lot! Documents & Links: Virtual Tour General Info: Property Type: Land Only Taxes: $7,209.02 / 2024 Lot Area: 7,458 sq. ft.692.87 m2 Lot Frontage: 66'20.117 m Lot Depth: 113 Water Supply: City/Municipal Additional Info: Title to Land: Freehold NonStrata Legal Description: LOT 16, BLOCK 36, PLAN NWP3036, DISTRICT LOT 30, GROUP 1, NEW WESTMINSTER LAND DISTRICT, 4350-7435 Land Info: Access to property: Allowed Access Cable Service: On Property Natural Gas: Available Electricity: Available Sanitary Sewer: Available Telephone Service: On Property Trees: No Storm Sewer: Available Sketch Attached: No Restrictions: None Listing Info: Original Price: $2,650,000"
  },
  {
    "listingId": "102515675",
    "shareUrl": "https://dorisgee.com/mylistings.html/listing.r2916088-4355-barker-avenue-burnaby-v5g-3c3.102515675",
    "listingDetails": "Status: Active MLS® Num: R2916088 Bedrooms: 6 Bathrooms: 5 Floor Area: 2,967 sq. ft.276 m2",
    "price": "$2,385,000",
    "address": "4355 BARKER Avenue Burnaby V5G 3C3 Burnaby Hospital",
    "detailedInfo": "Gorgeous Luxury 3 Level Duplex, almost 3,000 sq ft. Main floor 10ft Ceilings. Engineered Laminate Flooring. A/C, HRV, Hot Water Radiant Floor Heating, Security System with cameras. Hardie-Board/Plank. Open kitchen layout features Bosch appl's, a big kitchen island, and a family room overlooking the open deck. Spacious dining and living areas for formal entertaining. Den on the main can be an extra bedroom plus 3-piece bath. Upstairs, 3 bedrooms. Basement has a 3-bedroom Legal suite making a great mortgage helper. 2 Laundries. School Catchment K-7 Cascade Heights, Ecole Moscrop Secondary BCIT, SFU. Super Central between Amazing Brentwood, Metrotown Shopping, Crystal Mall, Deer Lake Park, Central Park, Lots of Rec Centres, Shadbolt Centre for the Arts, Sports Centres, Bonsor Rec Centres. 2-5-10 Home Warranty. Documents & Links: Virtual Tour General Info: Property Type: Residential Attached Dwelling Type: 1/2 Duplex Home Style: 2 Storey w/Bsmt. Year built: 2024 (Age: 0) Total area: 2,967 sq. ft.275.64 m2 Total Floor Area: 2,967 sq. ft.275.64 m2 Total unfinished area: 0 sq. ft.0 m2 Main Floor Area: 1,106 sq. ft.102.75 m2 Floor Area Above Main: 773 sq. ft.71.81 m2 Floor Area Above Main 2: 0 sq. ft.0 m2 Floor Area Below Main: 0 sq. ft.0 m2 Basement Area: 1,088 sq. ft.101.08 m2 No. Floor Levels: 3.0 Bedrooms: 6 (Above Grd: 3) Bathrooms: 5.0 (Full:5/Half:0) Kitchens: 2 Rooms: 20 Num Storeys: 3 Taxes: $6,089.87 / 2024 Lot Area: 7,134 sq. ft.662.77 m2 Lot Frontage: 58'17.678 m Lot Depth: 123 Exposure / Faces: East Rear Yard Exposure: West Outdoor Area: Patio(s) & Deck(s) Water Supply: City/Municipal Plan: EPS10625 Total Units in Strata: 2 Additional Info: Heating: Hot Water, Natural Gas, Radiant Construction: Frame - Wood Foundation: Concrete Perimeter Basement: Fully Finished, Separate Entry Full Height: 8'0 Roof: Asphalt Floor Finish: Laminate, Tile Fireplaces: 1 Fireplace Details: Electric Parking: Garage; Single Parking Total/Covered: 2 / 1 Parking Access: Lane, Rear Exterior Finish: Fibre Cement Board, Wood Title to Land: Freehold Strata Suite: Legal Suite Room Information: Floor Type Size Other Main Living Room 13'2\"4.01 m × 11'6\"3.51 m - Main Dining Room 13'2\"4.01 m × 9'2\"2.79 m - Main Kitchen 21'11\"6.68 m × 9'5\"2.87 m - Main Family Room 10'10\"3.30 m × 10'7\"3.23 m - Main Eating Area 11'4\"3.45 m × 10'11\"3.33 m - Main Den 9'9\"2.97 m × 8'7\"2.62 m - Main Laundry 7'2.13 m × 5'1\"1.55 m - Main Storage 10'4\"3.15 m × 6'10\"2.08 m - Above Primary Bedroom 15'3\"4.65 m × 11'2\"3.40 m - Above Walk-In Closet 5'8\"1.73 m × 5'1.52 m - Above Bedroom 10'6\"3.20 m × 10'3.05 m - Above Bedroom 11'1\"3.38 m × 9'3\"2.82 m - Above Utility 5'1\"1.55 m × 2'5\".74 m - Bsmt Living Room 12'3.66 m × 10'2\"3.10 m - Bsmt Dining Room 12'3.66 m × 6'4\"1.93 m - Bsmt Kitchen 9'4\"2.84 m × 6'6\"1.98 m - Bsmt Bedroom 8'9\"2.67 m × 8'9\"2.67 m - Bsmt Bedroom 12'2\"3.71 m × 9'10\"3.00 m - Bsmt Bedroom 15'11\"4.85 m × 12'1\"3.68 m - Bsmt Laundry 3'6\"1.07 m × 3'4\"1.02 m - Bathrooms: Floor Ensuite Pieces Other Main No 3 Above Yes 3 Above No 4 Bsmt No 4 Bsmt No 4 By-Law Restrictions: Pets Allowed, Rentals Allowed Maint. Fees: $.00 Features Included: Air Conditioning, Clothes Washer/Dryer/Fridge/Stove/Dishwasher, Drapes/Window Coverings, Garage Door Opener, Heat Recov. Vent., Security System, Smoke Alarm Site Influences: Central Location, Recreation Nearby, Shopping Nearby Amenities: None View: city Legal Description: STRATA LOT 1 DISTRICT LOT 38 GROUP 1 NEW WESTMINSTER DISTRICT STRATA PLAN EPS10625 TOGETHER WITH AN INTEREST IN THE COMMON PROPERTY IN PROPORTION TO THE UNITENTITLEMENT OF THE STRATA LOT AS SHOWN ON FORM V Other Details: Property Disclosure: No Fixtures Leased: No Fixtures Removed: No Services Connected: Electricity, Natural Gas Listing Info: Original Price: $2,385,000"
  },
  {
    "listingId": "102428158",
    "shareUrl": "https://dorisgee.com/mylistings.html/listing.r2912218-3654-tanner-street-vancouver-v5r-5p6.102428158",
    "listingDetails": "Status: Active MLS® Num: R2912218 Bedrooms: 4 Bathrooms: 1 Floor Area: 1,899 sq. ft.176 m2",
    "price": "$1,999,900",
    "address": "3654 TANNER Street Vancouver V5R 5P6 Collingwood VE",
    "detailedInfo": "One Family Home Owner Occupied. 3 Levels, 1,899 sq ft. 33 x 138 ft (plus back lane) High side of the street with BEAUTIFUL MOUNTAIN VIEWS. 3 Bedrooms Up and 1 in the Basement. Very well maintained and move-in ready. Hot Water Tank (approx. 2023) Furnace (approx. 2013) Roof (approx. 2018) Huge front and back yard with a deck off the back. Single garage with auto door, off back lane. School Catchments: K - 3: Collingwood (Bruce Annex) K - 7: Graham D. Bruce Elementary 8 - 12: Windermere Secondary. Location Highlights: Close to Boundary Road with Easy access to highways. Nearby local shopping on Kingsway and Central Park for a stroll. 10 minutes to Metrotown, T & T Superstore, Crystal Mall. Great Home to Live or Build your dream home, or Investment into holding or Multi Family building. Documents & Links: Virtual Tour General Info: Property Type: Residential Detached Dwelling Type: House/Single Family Home Style: 2 Storey w/Bsmt. Year built: 1912 (Age: 112) Total area: 1,899 sq. ft.176.42 m2 Total Floor Area: 1,899 sq. ft.176.42 m2 Price Per SqFt: $1,053.13 Total unfinished area: 0 sq. ft.0 m2 Main Floor Area: 721 sq. ft.66.98 m2 Floor Area Above Main: 507 sq. ft.47.1 m2 Floor Area Above Main 2: 0 sq. ft.0 m2 Floor Area Below Main: 0 sq. ft.0 m2 Basement Area: 671 sq. ft.62.34 m2 No. Floor Levels: 3.0 Bedrooms: 4 (Above Grd: 3) Bathrooms: 1.0 (Full:1/Half:0) Kitchens: 1 Rooms: 15 Taxes: $7,628.36 / 2024 Lot Area: 4,571 sq. ft.424.66 m2 Lot Frontage: 33'10.058 m Lot Depth: 138.50 Outdoor Area: Fenced Yard, Sundeck(s) Water Supply: City/Municipal Plan: VAP1570 Additional Info: Heating: Forced Air Construction: Frame - Wood Foundation: Concrete Perimeter Basement: None Roof: Asphalt Floor Finish: Mixed Fireplaces: 1 Fireplace Details: Other Parking: Garage; Single Parking Total/Covered: 1 / 1 Parking Access: Lane, Rear Exterior Finish: Stucco Title to Land: Freehold NonStrata Suite: None Room Information: Floor Type Size Other Main Living Room 10'5\"3.18 m × 9'11\"3.02 m - Main Dining Room 13'5\"4.09 m × 9'2.74 m - Main Kitchen 17'6\"5.33 m × 10'10\"3.30 m - Main Eating Area 10'6\"3.20 m × 6'11\"2.11 m - Main Pantry 6'8\"2.03 m × 2'11\".89 m - Main Foyer 8'11\"2.72 m × 6'2\"1.88 m - Above Primary Bedroom 12'10\"3.91 m × 9'1\"2.77 m - Above Storage 4'7\"1.40 m × 4'1.22 m - Above Bedroom 11'6\"3.51 m × 9'4\"2.84 m - Above Bedroom 12'6\"3.81 m × 9'7\"2.92 m - Bsmt Bedroom 14'8\"4.47 m × 9'10\"3.00 m - Bsmt Storage 9'7\"2.92 m × 4'1.22 m - Bsmt Storage 10'6\"3.20 m × 7'2.13 m - Bsmt Utility 11'8\"3.56 m × 9'10\"3.00 m - Bsmt Laundry 10'3\"3.12 m × 9'8\"2.95 m - Bathrooms: Floor Ensuite Pieces Other Main No 4 Features Included: Clothes Washer/Dryer/Fridge/Stove/Dishwasher, Drapes/Window Coverings Site Influences: Central Location, Recreation Nearby, Shopping Nearby View: MOUNTAIN VIEWS Legal Description: LOT 43, BLOCK 88, PLAN VAP1570, DISTRICT LOT 36 & 51, NEW WESTMINSTER LAND DISTRICT Other Details: Property Disclosure: Yes Fixtures Leased: No Fixtures Removed: No Services Connected: Electricity, Natural Gas Listing Info: Original Price: $1,999,900"
  }
]